content/writing/poetry/i-wonder-will-i-reach-it.org
#+startup: content indent

[[file:../../index.org][Giovanni's Diary]] > [[file:../../subjects.org][Subjects]] > [[file:../writing.org][Writing]] > [[file:poetry.org][Poetry]] > [[file:poems.org][Poems]] >

* I wonder will I reach it
:PROPERTIES:
:RSS: true
:DATE: 09 Oct 2025 00:00 GMT
:CATEGORY: Poetry
:AUTHOR: Giovanni Santini
:LINK: https://san7o.github.io/giovanni-diary/writing/poetry/i-wonder-will-i-reach-it.html
:END:
#+INDEX: Giovanni's Diary!Writing!Poetry!I wonder will I reach it

#+begin_quote
I wonder will I reach it
but perhaps, after all
may I believe my lie?

I'll call that place my home
the years be kind and warm

So I'll learn,
to grow myself the garden,
to overcome the winter

I'll explore,
salty oceans
and emerald mountains,
rivers of golden
and infinite hills

And I promise,
to keep my word
and to have courage
to redeem my errors

I come from where its dark and empty
it's destiny's fault, says I

What else should I do
on this tired boat
on what has been and what it is,
but to look forward in time
#+end_quote

09-10-2025

This poem was translated from Italian to English

-----

Travel: [[file:poetry.org][Poetry]], [[file:../../theindex.org][Index]] 
