public/writing/poetry/i-wonder-will-i-reach-it.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<link rel="stylesheet" href="/giovanni-diary/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../../subjects.html">Subjects</a> &gt; <a href="../writing.html">Writing</a> &gt; <a href="poetry.html">Poetry</a> &gt; <a href="poems.html">Poems</a> &gt;
</p>

<div id="outline-container-orgee75bef" class="outline-2">
<h2 id="orgee75bef">I wonder will I reach it</h2>
<div class="outline-text-2" id="text-orgee75bef">
<blockquote>
<p>
I wonder will I reach it
but perhaps, after all
may I believe my lie?
</p>

<p>
I'll call that place my home
the years be kind and warm
</p>

<p>
So I'll learn,
to grow myself the garden,
to overcome the winter
</p>

<p>
I'll explore,
salty oceans
and emerald mountains,
rivers of golden
and infinite hills
</p>

<p>
And I promise,
to keep my word
and to have courage
to redeem my errors
</p>

<p>
I come from where its dark and empty
it's destiny's fault, says I
</p>

<p>
What else should I do
on this tired boat
on what has been and what it is,
but to look forward in time
</p>
</blockquote>

<p>
09-10-2025
</p>

<p>
This poem was translated from Italian to English
</p>

<hr />

<p>
Travel: <a href="poetry.html">Poetry</a>, <a href="../../theindex.html">Index</a> 
</p>
</div>
</div>
</div>
</body>
</html>
